![IronHack Logo](https://s3-eu-west-1.amazonaws.com/ih-materials/uploads/upload_d5c5793015fec3be28a63c4fa3dd4d55.png)

# Lab | Advanced MySQL

## Introduction

In this lab you will practice SQL Subqueries and Action Queries. We will again use the publications database.

Create a `solutions.ipynb` file in the `your-code` directory to record your solutions to all challenges.

In [1]:
#Import os
import os
os.environ["GOOGLE_APPLICATION_CREDENTIALS"]="./ironhack_service_account_big_query.json"
from google.cloud import bigquery
client = bigquery.Client()

## Challenge 1 - Most Profiting Authors

In this challenge let's have a close look at the bonus challenge of the previous *SQL SELECT* lab -- **who are the top 3 most profiting authors**? Even if you have solved or think you have solved that problem in the previous lab, please still complete this challenge because the step-by-step guidances are helpful to train your problem-solving thinking.

In order to solve this problem, it is important for you to keep the following points in mind:

* In table `sales`, a title can appear several times. The royalties need to be calculated for each sale.

* Despite a title can have multiple `sales` records, the advance must be calculated only once for each title.

* In your eventual solution, you need to sum up the following profits for each individual author:
    * All advances which is calculated exactly once for each title.
    * All royalties in each sale.

Therefore, you will not be able to achieve the goal with a single SELECT query. Instead, you will need to follow several steps in order to achieve the eventual solution. Below is an overview of the steps:

1. Calculate the royalty of each sale for each author.

1. Using the output from Step 1 as a sub-table, aggregate the total royalties for each title for each author.

1. Using the output from Step 2 as a sub-table, calculate the total profits of each author by aggregating the advances and total royalties of each title.

Below we'll guide you through each step. In your `solutions.ipynb`, please include the SELECT queries of each step so that your TA can review your problem-solving process.

### Step 1: Calculate the royalties of each sales for each author

Write a SELECT query to obtain the following output:

* Title ID
* Author ID
* Royalty of each sale for each author
    * The formula is:
        ```
        sales_royalty = titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100
        ```
    * Note that `titles.royalty` and `titleauthor.royaltyper` are divided by 100 respectively because they are percentage numbers instead of floats.

In the output of this step, each title may appear more than once for each author. This is because a title can have more than one sales.

In [17]:
royalties_per_sale = '''
    SELECT
        tau.title_id AS Title_ID #from TAU
        ,price
        ,advance
        ,royalty
        ,qty
        ,au_id AS Author_ID #from TAU
        ,royaltyper
        ,(titles.price * sales.qty * titles.royalty / 100 * tau.royaltyper / 100) AS sales_royalty
    FROM
        `ironhack-data-analytics-265219.publications.titleauthor` as tau
    JOIN
        publications.titles AS titles
    ON
        tau.title_id = titles.title_id 
    JOIN 
        publications.sales AS sales
    ON
        tau.title_id = sales.title_id
    GROUP BY
        1,2,3,4,5,6,7
    ORDER BY
        1
    LIMIT 5;
    '''
query_job = client.query(query = royalties_per_sale)
query_job.to_dataframe()

  Title_ID  price  advance royalty qty    Author_ID royaltyper  sales_royalty
0   BU1032  19.99   5000.0      10   5  409-56-7008         60          5.997
1   BU1032  19.99   5000.0      10  10  409-56-7008         60         11.994
2   BU1032  19.99   5000.0      10   5  213-46-8915         40          3.998
3   BU1032  19.99   5000.0      10  10  213-46-8915         40          7.996
4   BU1111  11.95   5000.0      10  25  724-80-9391         60         17.925

### Step 2: Aggregate the total royalties for each title for each author

Using the output from Step 1, write a query to obtain the following output:

* Title ID
* Author ID
* Aggregated royalties of each title for each author
    * Hint: use the *SUM* subquery and group by both `au_id` and `title_id`

In the output of this step, each title should appear only once for each author.

In [26]:
total_royalties = '''
    SELECT
        t1.title_id
        ,author_id
        ,t1.advance
        ,SUM(sales_royalty) AS royalties_per_title
    FROM
        (SELECT
            tau.title_id AS Title_ID #from TAU
            ,price
            ,advance
            ,royalty
            ,qty
            ,au_id AS Author_ID #from TAU
            ,royaltyper
            ,(titles.price * sales.qty * titles.royalty / 100 * tau.royaltyper / 100) AS sales_royalty
        FROM
            `ironhack-data-analytics-265219.publications.titleauthor` as tau
        JOIN
            publications.titles AS titles
        ON
            tau.title_id = titles.title_id 
        JOIN 
            publications.sales AS sales
        ON
            tau.title_id = sales.title_id
        ) AS t1
    GROUP BY
        1, 2, 3
    ORDER BY
        1
    LIMIT 5   

'''


query_job = client.query(query = total_royalties)
query_job.to_dataframe()

  title_id    author_id  advance  royalties_per_title
0   BU1032  213-46-8915   5000.0               11.994
1   BU1032  409-56-7008   5000.0               17.991
2   BU1111  267-41-2394   5000.0               11.950
3   BU1111  724-80-9391   5000.0               17.925
4   BU2075  213-46-8915  10125.0               25.116

### Step 3: Calculate the total profits of each author

Now that each title has exactly one row for each author where the advance and royalties are available, we are ready to obtain the eventual output. Using the output from Step 2, write a query to obtain the following output:

* Author ID
* Profits of each author by aggregating the advance and total royalties of each title

Sort the output based on a total profits from high to low, and limit the number of rows to 3.

In [60]:
total_profits = '''
    SELECT
        t1.author_id
        ,SUM(advance + sales_royalty) AS Profits_per_title
    FROM 
        (SELECT
                tau.title_id AS Title_ID #from TAU
                ,price
                ,advance * tau.royaltyper / 100 AS Advance
                ,royalty
                ,qty
                ,au_id AS Author_ID #from TAU
                ,royaltyper
                ,(titles.price * sales.qty * titles.royalty / 100 * tau.royaltyper / 100) AS sales_royalty
        FROM
                `ironhack-data-analytics-265219.publications.titleauthor` as tau
        JOIN
                publications.titles AS titles
        ON
                tau.title_id = titles.title_id 
        JOIN 
                publications.sales AS sales
        ON
                tau.title_id = sales.title_id
            ) AS t1
     
            
    GROUP BY
        1
    ORDER BY
        2 DESC
    LIMIT 3;

'''




query_job = client.query(query = total_profits)
query_job.to_dataframe()
#RESULTADOS SUM(sales_royalty) son el Total y no por autor

     author_id  Profits_per_title
0  722-51-5454          22521.528
1  213-46-8915          14162.110
2  899-46-2035          12128.132

## Challenge 2

Elevating from your solution in Challenge 1 , create a table named `most_profiting_authors` to hold the data about the most profiting authors. The table should have 2 columns:

* `au_id` - Author ID
* `profits` - The profits of the author aggregating the advances and royalties

Include your solution in `solutions.ipynb`.

In [70]:
most_profiting_authors =  '''
    CREATE TABLE `ironhack-data-analytics-265219.publications.most_profiting_authors_gabi`(
    au_id STRING ,
    profits NUMERIC
    )
    '''


sql=    '''
    INSERT INTO `ironhack-data-analytics-265219.publications.most_profiting_authors_gabi`
    VALUES
        ('722-51-5454', 22521.528),
        ('213-46-8915', 14162.110),
        ('899-46-2035', 12128.132)
    '''
    




query_job = client.query(query = most_profiting_authors)
query_job.to_dataframe()
query_job_2 = client.query(query = sql)
query_job_2.to_dataframe()

Empty DataFrame
Columns: []
Index: []